DBSPlayground/nuttx-astyle/test/imxrt/ifdef_test_imxrt_lpspi.c
void imxrt_lpspi_clock_enable(uint32_t base)
{
  if (base == IMXRT_LPSPI1_BASE)
    {
      imxrt_clockall_lpspi1();
    }
  else if (base == IMXRT_LPSPI2_BASE)
    {
      imxrt_clockall_lpspi2();
    }
  else if (base == IMXRT_LPSPI3_BASE)
    {
      imxrt_clockall_lpspi3();
    }
  else if (base == IMXRT_LPSPI4_BASE)
    {
      imxrt_clockall_lpspi4();
    }
}

/************************************************************************************
 * Name: imxrt_lpspi_clock_disable
 *
 * Description:
 *   Gate LPSPI clock
 *
 ************************************************************************************/

void imxrt_lpspi_clock_disable(uint32_t base)
{
  if (base == IMXRT_LPSPI1_BASE)
    {
      imxrt_clockoff_lpspi1();
    }
  else if (base == IMXRT_LPSPI2_BASE)
    {
      imxrt_clockoff_lpspi2();
    }
  else if (base == IMXRT_LPSPI3_BASE)
    {
      imxrt_clockoff_lpspi3();
    }
  else if (base == IMXRT_LPSPI4_BASE)
    {
      imxrt_clockoff_lpspi4();
    }
}

/************************************************************************************
 * Name: imxrt_lpspi_bus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus in its default state (Master, 8-bit, mode 0, etc.)
 *
 * Input Parameters:
 *   priv   - private SPI device structure
 *
 * Returned Value:
 *   None
 *
 ************************************************************************************/

static void imxrt_lpspi_bus_initialize(struct imxrt_lpspidev_s *priv)
{
  uint32_t reg = 0;

  /* Enable power and reset the peripheral */

  imxrt_lpspi_clock_enable(priv->spibase);

  /* Reset to known status */

  imxrt_lpspi_modifyreg32(priv, IMXRT_LPSPI_CR_OFFSET, 0, LPSPI_CR_RST);
  imxrt_lpspi_modifyreg32(priv, IMXRT_LPSPI_CR_OFFSET, 0,
                          LPSPI_CR_RTF | LPSPI_CR_RRF);
  imxrt_lpspi_putreg32(priv, IMXRT_LPSPI_CR_OFFSET, 0x00);

  /* Set LPSPI to master */

  imxrt_lpspi_modifyreg32(priv, IMXRT_LPSPI_CFGR1_OFFSET, 0,
                          LPSPI_CFGR1_MASTER);

  /* Set specific PCS to active high or low */
  /* TODO: Not needed for now */

  /* Set Configuration Register 1 related setting. */

  reg = imxrt_lpspi_getreg32(priv, IMXRT_LPSPI_CFGR1_OFFSET);
  reg &= ~(LPSPI_CFGR1_OUTCFG | LPSPI_CFGR1_PINCFG_MASK | LPSPI_CFGR1_NOSTALL);
  reg |= LPSPI_CFGR1_OUTCFG_RETAIN | LPSPI_CFGR1_PINCFG_SIN_SOUT;
  imxrt_lpspi_putreg32(priv, IMXRT_LPSPI_CFGR1_OFFSET, reg);

  /* Set frequency and delay times */

  imxrt_lpspi_setfrequency((FAR struct spi_dev_s *)priv, 400000);

  /* Set default watermarks */

  imxrt_lpspi_putreg32(priv, IMXRT_LPSPI_FCR_OFFSET,
                       LPSPI_FCR_TXWATER(0) | LPSPI_FCR_RXWATER(0));

  /* Set Transmit Command Register */

  imxrt_lpspi_setbits((FAR struct spi_dev_s *)priv, 8);

  imxrt_lpspi_setmode((FAR struct spi_dev_s *)priv, SPIDEV_MODE0);

  /* Initialize the SPI semaphore that enforces mutually exclusive access */

  nxsem_init(&priv->exclsem, 0, 1);

  /* Enable LPSPI */

  imxrt_lpspi_modifyreg32(priv, IMXRT_LPSPI_CR_OFFSET, 0, LPSPI_CR_MEN);
}

/************************************************************************************
 * Public Functions
 ************************************************************************************/

/************************************************************************************
 * Name: imxrt_lpspibus_initialize
 *
 * Description:
 *   Initialize the selected SPI bus
 *
 * Input Parameters:
 *   Port number (for hardware that has mutiple SPI interfaces)
 *
 * Returned Value:
 *   Valid SPI device structure reference on success; a NULL on failure
 *
 ************************************************************************************/

FAR struct spi_dev_s *imxrt_lpspibus_initialize(int bus)
{
  FAR struct imxrt_lpspidev_s *priv = NULL;

  irqstate_t flags = enter_critical_section();

#ifdef CONFIG_IMXRT_LPSPI1
  if (bus == 1)
    {
      /* Select SPI1 */

      priv = &g_lpspi1dev;

      /* Only configure if the bus is not already configured */

      if ((imxrt_lpspi_getreg32(priv, IMXRT_LPSPI_CR_OFFSET) & LPSPI_CR_MEN) == 0)
        {
          /* Configure SPI1 pins: SCK, MISO, and MOSI */

          (void)imxrt_config_gpio(GPIO_LPSPI1_SCK);
          (void)imxrt_config_gpio(GPIO_LPSPI1_MISO);
          (void)imxrt_config_gpio(GPIO_LPSPI1_MOSI);

          putreg32(0x1, IMXRT_INPUT_LPSPI1_SCK);
          putreg32(0x1, IMXRT_INPUT_LPSPI1_SDI);
          putreg32(0x1, IMXRT_INPUT_LPSPI1_SDO);

          /* Set up default configuration: Master, 8-bit, etc. */

          imxrt_lpspi_bus_initialize(priv);
        }
    }
  else
#endif
#ifdef CONFIG_IMXRT_LPSPI2
    if (bus == 2)
      {
        /* Select SPI2 */

        priv = &g_lpspi2dev;

        /* Only configure if the bus is not already configured */

        if ((imxrt_lpspi_getreg32(priv, IMXRT_LPSPI_CR_OFFSET) & LPSPI_CR_MEN) == 0)
          {
            /* Configure SPI2 pins: SCK, MISO, and MOSI */

            (void)imxrt_config_gpio(GPIO_LPSPI2_SCK);
            (void)imxrt_config_gpio(GPIO_LPSPI2_MISO);
            (void)imxrt_config_gpio(GPIO_LPSPI2_MOSI);

            /* Set up default configuration: Master, 8-bit, etc. */

            imxrt_lpspi_bus_initialize(priv);
          }
      }
    else
#endif
#ifdef CONFIG_IMXRT_LPSPI3
      if (bus == 3)
        {
          /* Select SPI3 */

          priv = &g_lpspi3dev;

          /* Only configure if the bus is not already configured */

          if ((imxrt_lpspi_getreg32(priv, IMXRT_LPSPI_CR_OFFSET) & LPSPI_CR_MEN) == 0)
            {
              /* Configure SPI3 pins: SCK, MISO, and MOSI */

              (void)imxrt_config_gpio(GPIO_LPSPI3_SCK);
              (void)imxrt_config_gpio(GPIO_LPSPI3_MISO);
              (void)imxrt_config_gpio(GPIO_LPSPI3_MOSI);

              /* Set up default configuration: Master, 8-bit, etc. */

              imxrt_lpspi_bus_initialize(priv);
            }
        }
      else
#endif
#ifdef CONFIG_IMXRT_LPSPI4
        if (bus == 4)
          {
            /* Select SPI4 */

            priv = &g_lpspi4dev;

            /* Only configure if the bus is not already configured */

            if ((imxrt_lpspi_getreg32(priv, IMXRT_LPSPI_CR_OFFSET) & LPSPI_CR_MEN) == 0)
              {
                /* Configure SPI4 pins: SCK, MISO, and MOSI */

                (void)imxrt_config_gpio(GPIO_LPSPI4_SCK);
                (void)imxrt_config_gpio(GPIO_LPSPI4_MISO);
                (void)imxrt_config_gpio(GPIO_LPSPI4_MOSI);

                /* Set up default configuration: Master, 8-bit, etc. */

                imxrt_lpspi_bus_initialize(priv);
              }
          }
        else
#endif
          {
            spierr("ERROR: Unsupported SPI bus: %d\n", bus);
            return NULL;
          }

  leave_critical_section(flags);

  return (FAR struct spi_dev_s *)priv;
}

#endif /* CONFIG_IMXRT_LPSPI1 */
